Revit 2024 API
StairsPath.DownTextOffset Property
 The offset of stairs down text.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ DownTextOffset { get; set; }
Visual Basic
Public Property DownTextOffset As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ DownTextOffset {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 The z direction makes no sense in API.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The type of this stairs path is not automatic up/down direction. -or- When setting this property: The stairs path doesn't show down text so the data being set is inapplicable.
See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace